src/cf/Enums/пбп_ТипыТочкиОбменаRabbitMQ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>пбп_ТипыТочкиОбменаRabbitMQ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>direct</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>fanout</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>topic</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/пбп_RabbitMQПовтИсп/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьТипТочкиОбменаСтрокой(ТипТочкиОбмена) Экспорт
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(Перечисления.пбп_ТипыТочкиОбменаRabbitMQ.direct, "direct");
	Соответствие.Вставить(Перечисления.пбп_ТипыТочкиОбменаRabbitMQ.fanout, "fanout");
	Соответствие.Вставить(Перечисления.пбп_ТипыТочкиОбменаRabbitMQ.topic, "topic");
	
	ТипСтрокой = Соответствие[ТипТочкиОбмена];
	
	Если ТипСтрокой = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат ТипСтрокой;
	
КонецФункции

#КонецОбласти
